{
    "Education":[
        {
            "School":"University of Reading",
            "Logo":"Reading University.png",
            "Start Date":"10/2009",
            "End Date":"07/2013",
            "Course":"Robotics",
            "Grades":"2:1 MEng Robotics (Honours)",
            "url":"http://www.reading.ac.uk/"
        },
        {
            "School":"Hazelwick School",
            "Logo":"Hazelwick.png",
            "Start Date":"09/2003",
            "End Date":"06/2009",
            "Course":"",
            "Grades":"A-Level Electronics (A), Math's (C), Physics (C)\n10 GCSEs (Grades A, B and C)",
            "url":"https://www.hazelwick.org/"
        }
    ],
    "Experience":[
        {
            "Company":"Fidessa",
            "Logo":"Fidessa.png",
            "Roles":[
                {
                    "Role":"Developer, Tools and Automation",
                    "Location":"Woking, Surrey, United Kingdom",
                    "Start Date":"01/01/2021",
                    "End Date":"",
                    "Description":"Working as part of a team that designs and develops internal software solutions to automate the work of the delivery and other development teams. This is to ensure as part of the CI/CD principles that software is produced and distributed using the same means.\nVue.js, Python, Tcl, Bash, csh, Rundeck, Perforce and Fidessa’s proprietary DB is used for creating these applications."
                },
                {
                    "Role":"Delivery Engineer",
                    "Location":"Woking, Surrey, United Kingdom",
                    "Start Date":"24/11/2014",
                    "End Date":"31/12/2020",
                    "Description":"Worked as part of a team that was responsible for the technical delivery and maintenance of Fidessa’s multi-asset, sell-side trading platforms. On a managed, Software as a Service (SaaS) basis. The role included: building new customer systems; performing software upgrades; enabling new functionality and handling customer change and enhancement requests. The predominant languages used in these tasks is Tcl, SQL and Fidessa's proprietary language.\nMy secondary role was to help make tasks the department performed regularly as automated as possible. So I spent time coming up with new scripts and enhancing old ones to make our day to day jobs as quick and as efficient as possible. Python, MongoDB and Perforce were used to complete these tasks."
                }
            ],
            "url":"https://iongroup.com/ion-markets/eq/fidessa/?colour=blue&customRedirect=useful-links/privacy-policy"
        },
        {
            "Company":"Advanced Roofing Services Ltd",
            "Logo":"Advanced Roofing.png",
            "Roles":[
                {
                    "Role":"Logistics Assistant",
                    "Location":"Forest Row, East Sussex, United Kingdom",
                    "Start Date":"01/07/2013",
                    "End Date":"01/11/2014",
                    "Description":"My role at this company is to help with the organising and setting up of sites, making sure the sites are safe and the materials arrive on time. My time here has taught me the value of teamwork and good communication skills."
                }
            ],
            "url":"https://www.advancedroofingservices.co.uk/"
        },
        {
            "Company":"Total Hospitality",
            "Logo":"Total Hospitality.png",
            "Roles":[
                {
                    "Role":"Waiter",
                    "Location":"Reading, Berkshire",
                    "Start Date":"01/06/2012",
                    "End Date":"01/06/2013",
                    "Description":"Within this job I worked as part of a team, waiting on brides, grooms and their wedding guests ensuring they all enjoyed their day. Working part time here while in my final year of university helped me further develop my time management and prioritisation skills."
                }
            ],
            "url":"https://www.total-hospitality.co.uk/"
        }
    ],
    "Awards": [
        {
            "Location":"Fidessa",
            "Description":"During my time at Fidessa I have received two awards:",
            "Awards":[
                {
                    "Name":"Commitment and Dedication"
                },
                {
                    "Name":"Service / Excellence"
                }
            ]
        }
    ],
    "Technical Skills":[
        {
            "Skill":"Python",
            "Description":"Originally used and picked up at University for my projects. I now use it to create automation tools for the department. Around 3-4 years ago some of the tools and scripts the department was using were migrated to Python and I was heavily involved."
        },
        {
            "Skill":"Vue.js",
            "Description":"Started using at the beginning of 2021 to create an interface for allowing teams to keep track of their automated deployments."
        },
        {
            "Skill":"Tcl",
            "Description":"Originally picked up and learnt during my time at Fidessa, so now looking at roughly 5 years of experience."
        },
        {
            "Skill":"Proprietary Languages",
            "Description":"I also have some experience with a proprietary language, as Fidessa has its own in house language that is used from time to time."
        },
        {
            "Skill":"SQL",
            "Description":"Around 4 years of experience using SQL at Work."
        },
        {
            "Skill":"MongoDB",
            "Description":"Around 1 years worth of experience."
        },
        {
            "Skill":"Regex",
            "Description":"Regex has been an incredibly useful tool to parse and manipulate data both at university and my time at Fidessa."
        },
        {
            "Skill":"Perforce",
            "Description":"Perforce is the main source control software I have used at work."
        },
        {
            "Skill":"Rundeck",
            "Description":"Used for deploying and running automation scripts accross the client base."
        },
        {
            "Skill":"Review Board",
            "Description":"Used at my time at Fidessa to track pending changlists waiting for review."
        },
        {
            "Skill":"Office Suites",
            "Description":"Microsoft Office (Word, Excel, Powerpoint)"
        }
    ]
}